#+TITLE: Linear Regression
#+AUTHOR: M. Yas. Davoodeh

#+PROPERTY: header-args:python :session lr :results output

This file is my first practice in ML field.

* Execute and draw (represent)

#+begin_src python
clf = MyLinearRegression()


def represent(i):
    clf.fit(X_train[:, i], y_train)
    # TODO Plot for 2d samples
    try:
        if 0 <= i:
            # Plot for 1d samples
            plt.scatter(X_train[:, i], clf.y)
            plt.plot(
                np.linspace(-5, 5, 100),
                clf.Theta[0] + clf.Theta[1] * np.linspace(-5, 5, 100),
                "-r",
            )
            plt.show()
            # Plot for comparing 1d samples and predictions
            pred_y = clf.predict(X_test[:, i])
            plt.scatter(X_test[:, i], y_test)
            plt.scatter(X_test[:, i], pred_y)
            plt.show()
    except TypeError:
        pass

    # Cost plot
    plt.plot(clf.mse_history)
    plt.show()
    score = clf.score(X_test[:, i], y_test)
    print("The score of your model is: {}".format(score))
    return score


print("Printing learning curve for all the features")
my_score = represent(...)  # For all features use ...
# Only feature 0 is really good for testing with such a basic implementation
print("Now printing all features one by one (why not?)")
for i in range(0, X_train.shape[1]):
    represent(i)
#+end_src

#+RESULTS:
: Printing learning curve for all the features
: The score of your model is: 0.9787069678834638
: Now printing all features one by one (why not?)
: The score of your model is: 0.9786696462254381
: The score of your model is: 0.06047363363728797
: The score of your model is: -0.00022860105204980385
: The score of your model is: 0.2547786883298706

* Compare to Scikit

#+begin_src python
from sklearn.linear_model import LinearRegression

clf = LinearRegression()
clf.fit(X_train, y_train)
sk_score = clf.score(X_test, y_test)

print(
    "Your score using all features was {} and Sklearn's was {} which is {:f}% different".format(
        my_score, sk_score, -(my_score - sk_score) / my_score
    )
)
#+end_src

#+RESULTS:
: Your score using all features was 0.9787069678834638 and Sklearn's was 0.9786974028559039 which is -0.000010% different
